12a13,21
> admin ls
> chuser.c
> chuser
> test0.txt
> test1.txt
> test2.txt
> test3.txt
> filePerm.txt
> users.txt
26a36
> admin echo This is cool
28a39
> admin echo I know how to handle spaces
30a42,43
> admin cat f1.txt
> f1.txt
33,35c46,49
< shell>  f1.txt
< This is f1
< It contains text
---
> Cat is done
> shell>  test1.txt
> admin test1.txt
> Cat is done
36a51,52
> admin cat f1.txt f2.txt
> f1.txt
38a55
> f2.txt
44a62
> Cat is done
46,51c64,65
< 0
< 11
< 222
< 3333
< 44444
< 555555
---
> admin f2.txt f1.txt
> Cat is done
52a67,68
> admin cat f1.txt f2.txt f1.txt f2.txt
> f1.txt
54a71
> f2.txt
60a78
> f1.txt
62a81
> f2.txt
68a88
> Cat is done
69a90
> admin gcc
71a93,94
> admin cat notThere
> notThere
73a97
> admin shutdown
