spawn qemu-system-x86_64 -nographic --serial mon:stdio -hdc kernel/kernel.img -hdd fat439/user.img
x
What just happened? Who am I? Why am I here?
I am K439, welcome to my world
I have a heap
[] Process tracing enabled
Pit::init freq=1000HZ, divide=1193
Pit::init requested:1000Hz, actual:1000Hz
[] loaded driver for hdd
[] initialized root filesystem
[] Let there be processes
shell> ls
admin ls
chuser.c
chuser
test0.txt
test1.txt
test2.txt
test3.txt
filePerm.txt
users.txt
shutdown
shutdown.c
shell.c
shell
ls.c
ls
echo
echo.c
cat.c
cat
f1.txt
f2.txt
panic
shell> echo This is cool
admin echo This is cool
This is cool
shell>     echo    I know    how  to         handle  spaces   
admin echo I know how to handle spaces
I know how to handle spaces
shell> cat f1.txt
admin cat f1.txt
f1.txt
This is f1
It contains text
Cat is done
shell>  test1.txt
admin test1.txt
Cat is done
shell> cat f1.txt f2.txt
admin cat f1.txt f2.txt
f1.txt
This is f1
It contains text
f2.txt
0
11
222
3333
44444
555555
Cat is done
shell> f2.txt f1.txt
admin f2.txt f1.txt
Cat is done
shell> cat f1.txt f2.txt f1.txt f2.txt
admin cat f1.txt f2.txt f1.txt f2.txt
f1.txt
This is f1
It contains text
f2.txt
0
11
222
3333
44444
555555
f1.txt
This is f1
It contains text
f2.txt
0
11
222
3333
44444
555555
Cat is done
shell> gcc
admin gcc
gcc: command not found
shell> cat notThere
admin cat notThere
notThere
cat: notThere: No such file or directory
shell> shutdown
admin shutdown

*** System Shutdown ***
